= 
schmurky
:keywords: advanced hunting, threat hunting, cyber threat hunting,
Microsoft 365 Defender, microsoft 365, m365, search, query, telemetry,
schema reference, kusto, table, column, data type, description, threat &
vulnerability management, TVM, device management, security
configuration, MITRE ATT&CK framework, knowledge base, KB,
DeviceTvmSecureConfigurationAssessmentKB, MDVM, Microsoft Defender
Vulnerability Management

== DeviceTvmSecureConfigurationAssessmentKB

{empty}[!INCLUDE link:../includes/microsoft-defender.md[Microsoft 365
Defender rebranding]]

*Applies to:* - Microsoft 365 Defender - Microsoft Defender for Endpoint

The `DeviceTvmSecureConfigurationAssessmentKB` table in the advanced
hunting schema contains information about the various secure
configurations checked by
link:/windows/security/threat-protection/microsoft-defender-atp/next-gen-threat-and-vuln-mgt[Microsoft
Defender Vulnerability Management]. It also includes risk information,
related industry benchmarks, and applicable MITRE ATT&CK techniques and
tactics.

This table doesn’t return events or records. We recommend joining this
table to the
link:advanced-hunting-devicetvmsecureconfigurationassessment-table.md[DeviceTvmSecureConfigurationAssessment]
table using `ConfigurationId` to view text information about the
security configurations in the returned assessments.

For example, when you query the `DeviceTvmSecureConfigurationAssessment`
table you might want to view the `ConfigurationDescription` for the
security configurations that come up in the assessment results. You can
see this information by joining this table to
`DeviceTvmSecureConfigurationAssessment` using `ConfigurationId` and
project `ConfigurationDescription`.

For information on other tables in the advanced hunting schema, see
link:advanced-hunting-schema-tables.md[the advanced hunting reference].

[width="100%",cols="36%,29%,35%",options="header",]
|===
|Column name |Data type |Description
|`ConfigurationId` |`string` |Unique identifier for a specific
configuration

|`ConfigurationImpact` |`string` |Rated impact of the configuration to
the overall configuration score (1-10)

|`ConfigurationName` |`string` |Display name of the configuration

|`ConfigurationDescription` |`string` |Description of the configuration

|`RiskDescription` |`string` |Description of the associated risk

|`ConfigurationCategory` |`string` |Category or grouping to which the
configuration belongs: Application, OS, Network, Accounts, Security
controls

|`ConfigurationSubcategory` |`string` |Subcategory or subgrouping to
which the configuration belongs. In many cases, this describes specific
capabilities or features.

|`ConfigurationBenchmarks` |`string` |List of industry benchmarks
recommending the same or similar configuration

|`Tags` |`string` |Labels representing various attributes used to
identify or categorize a security configuration

|`RemediationOptions` |`string` |Recommended actions to reduce or
address any associated risks
|===

You can try this example query to return relevant configuration metadata
along with information on devices with non-compliant antivirus
configurations from the `DeviceTvmSecureConfigurationAssessment` table:

[source,kusto]
----
// Get information on devices with antivirus configurations issues
DeviceTvmSecureConfigurationAssessment
| where ConfigurationSubcategory == 'Antivirus' and IsApplicable == 1 and IsCompliant == 0
| join kind=leftouter (
    DeviceTvmSecureConfigurationAssessmentKB
    | project ConfigurationId, ConfigurationName, ConfigurationDescription, RiskDescription, Tags, ConfigurationImpact
) on ConfigurationId
| project DeviceName, OSPlatform, ConfigurationId, ConfigurationName, ConfigurationCategory, ConfigurationSubcategory, ConfigurationDescription, RiskDescription, ConfigurationImpact, Tags
----

=== Related topics

* link:advanced-hunting-overview.md[Proactively hunt for threats]
* link:advanced-hunting-query-language.md[Learn the query language]
* link:advanced-hunting-shared-queries.md[Use shared queries]
* link:advanced-hunting-query-emails-devices.md[Hunt across devices&#44;
emails&#44; apps&#44; and identities]
* link:advanced-hunting-schema-tables.md[Understand the schema]
* link:advanced-hunting-best-practices.md[Apply query best practices]
* link:/windows/security/threat-protection/microsoft-defender-atp/next-gen-threat-and-vuln-mgt[Overview
of Microsoft Defender Vulnerability Management]
