= Advanced hunting example for Microsoft Defender for Office 365
:audience: ITPro
:author: dansimp
:description: Get started searching for email threats using advanced hunting
:f1.keywords: ["NOCSH"]
:keywords: advanced hunting, threat hunting, cyber threat hunting, Microsoft 365 Defender, microsoft 365, m365, search, query, telemetry, custom detections, schema, kusto
:manager: dansimp
:ms.author: dansimp
:ms.collection: ["M365-security-compliance", "m365initiative-m365-defender"]
:ms.localizationpriority: medium
:ms.mktglfcycl: deploy
:ms.pagetype: security
:ms.service: microsoft-365-security
:ms.sitesec: library
:ms.subservice: m365d
:ms.topic: article
:search.appverid: met150
:search.product: eADQiWindows 10XVcnh

== Advanced hunting example for Microsoft Defender for Office 365

[!INCLUDE xref:../includes/microsoft-defender.adoc[Microsoft 365 Defender rebranding]]

*Applies to:*

* Microsoft 365 Defender

Want to get started searching for email threats using advanced hunting?
Try this:

The link:/microsoft-365/security/office-365-security/defender-for-office-365#getting-started[Getting Started] section of the link:/microsoft-365/security/office-365-security/defender-for-office-365[Microsoft Defender for Office 365 article] has logical early configuration chunks that look like this:

. Configure everything with 'Anti' in the name.
 ** Anti-malware
 ** Anti-phishing
 ** Anti-spam
. Set up everything with 'Safe' in the name.
 ** Safe Links
 ** Safe Attachments
. Defend the workloads (ex.
SharePoint Online, OneDrive, and Teams).
. Protect with zero-Hour auto purge.

Along with a xref:../office-365-security/protect-against-threats.adoc[link] to jump right in and get configuration going on Day 1.

The last step in *Getting Started* is protecting users with *Zero-Hour auto purge*, also known as ZAP.
Knowing if your efforts to ZAP a suspicious or malicious mail, post-delivery, were successful can be very important.

Quickly navigating to Kusto query language to hunt for issues is an advantage of converging these two security centers.
Security teams can monitor ZAP misses by taking their next steps https://security.microsoft.com/advanced-hunting[here], under *Hunting* > *Advanced Hunting*.

. On the Advanced Hunting page, click *Query*.
. Copy the query below into the query window.
. Select *Run query*.

[,kusto]
----
EmailPostDeliveryEvents
| where Timestamp > ago(7d)
//List malicious emails that were not zapped successfullyconverge-2-endpoints-new.png
| where ActionType has "ZAP" and ActionResult == "Error"
| project ZapTime = Timestamp, ActionType, NetworkMessageId , RecipientEmailAddress
//Get logon activity of recipients using RecipientEmailAddress and AccountUpn
| join kind=inner IdentityLogonEvents on $left.RecipientEmailAddress == $right.AccountUpn
| where Timestamp between ((ZapTime-24h) .. (ZapTime+24h))
//Show only pertinent info, such as account name, the app or service, protocol, the target device, and type of logon
| project ZapTime, ActionType, NetworkMessageId , RecipientEmailAddress, AccountUpn,
LogonTime = Timestamp, AccountDisplayName, Application, Protocol, DeviceName, LogonType
----

:::image type="content" source="../../media/ah-query-example-new.png" alt-text="The Advanced hunting page (under Hunting) with Query selected at the top of the query panel, and running a Kusto query to capture ZAP actions over the last 7 days." lightbox="../../media/ah-query-example-new.png":::

The data from this query will appear in the results panel below the query itself.
Results include information like 'DeviceName', 'AccountDisplayName', and 'ZapTime' in a customizable result set.
Results can also be exported for your records.
If the query is one you'll need again, select *Save* > *Save As* and add the query to your list of queries, shared, or community queries.

=== Related information

* xref:advanced-hunting-best-practices.adoc[Advanced hunting best practices]
* xref:advanced-hunting-overview.adoc[Overview - Advanced hunting]
