= DeviceTvmSecureConfigurationAssessmentKB table in the advanced hunting schema
:audience: ITPro
:author: schmurky
:description: Learn about the various secure configurations assessed by Microsoft Defender Vulnerability Management in the DeviceTvmSecureConfigurationAssessmentKB table of the advanced hunting schema.
:f1.keywords: ["NOCSH"]
:keywords: advanced hunting, threat hunting, cyber threat hunting, Microsoft 365 Defender, microsoft 365, m365, search, query, telemetry, schema reference, kusto, table, column, data type, description, threat & vulnerability management, TVM, device management, security configuration, MITRE ATT&CK framework, knowledge base, KB, DeviceTvmSecureConfigurationAssessmentKB, MDVM, Microsoft Defender Vulnerability Management
:manager: dansimp
:ms.author: maccruz
:ms.collection: m365-security-compliance
:ms.localizationpriority: medium
:ms.mktglfcycl: deploy
:ms.pagetype: security
:ms.service: microsoft-365-security
:ms.sitesec: library
:ms.subservice: m365d
:ms.topic: article
:search.appverid: met150
:search.product: eADQiWindows 10XVcnh

== DeviceTvmSecureConfigurationAssessmentKB

[!INCLUDE xref:../includes/microsoft-defender.adoc[Microsoft 365 Defender rebranding]]

*Applies to:*

* Microsoft 365 Defender
* Microsoft Defender for Endpoint

The `DeviceTvmSecureConfigurationAssessmentKB` table in the advanced hunting schema contains information about the various secure configurations checked by link:/windows/security/threat-protection/microsoft-defender-atp/next-gen-threat-and-vuln-mgt[Microsoft Defender Vulnerability Management].
It also includes risk information, related industry benchmarks, and applicable MITRE ATT&CK techniques and tactics.

This table doesn't return events or records.
We recommend joining this table to the xref:advanced-hunting-devicetvmsecureconfigurationassessment-table.adoc[DeviceTvmSecureConfigurationAssessment] table using `ConfigurationId` to view text information about the security configurations in the returned assessments.

For example, when you query the `DeviceTvmSecureConfigurationAssessment` table you might want to view the `ConfigurationDescription` for the security configurations that come up in the assessment results.
You can see this information by joining this table to `DeviceTvmSecureConfigurationAssessment` using `ConfigurationId` and project `ConfigurationDescription`.

For information on other tables in the advanced hunting schema, see xref:advanced-hunting-schema-tables.adoc[the advanced hunting reference].

|===
| Column name | Data type | Description

| `ConfigurationId`
| `string`
| Unique identifier for a specific configuration

| `ConfigurationImpact`
| `string`
| Rated impact of the configuration to the overall configuration score (1-10)

| `ConfigurationName`
| `string`
| Display name of the configuration

| `ConfigurationDescription`
| `string`
| Description of the configuration

| `RiskDescription`
| `string`
| Description of the associated risk

| `ConfigurationCategory`
| `string`
| Category or grouping to which the configuration belongs: Application, OS, Network, Accounts, Security controls

| `ConfigurationSubcategory`
| `string`
| Subcategory or subgrouping to which the configuration belongs.
In many cases, this describes specific capabilities or features.

| `ConfigurationBenchmarks`
| `string`
| List of industry benchmarks recommending the same or similar configuration

| `Tags`
| `string`
| Labels representing various attributes used to identify or categorize a security configuration

| `RemediationOptions`
| `string`
| Recommended actions to reduce or address any associated risks
|===

You can try this example query to return relevant configuration metadata along with information on devices with non-compliant antivirus configurations from the `DeviceTvmSecureConfigurationAssessment` table:

[,kusto]
----
// Get information on devices with antivirus configurations issues
DeviceTvmSecureConfigurationAssessment
| where ConfigurationSubcategory == 'Antivirus' and IsApplicable == 1 and IsCompliant == 0
| join kind=leftouter (
    DeviceTvmSecureConfigurationAssessmentKB
    | project ConfigurationId, ConfigurationName, ConfigurationDescription, RiskDescription, Tags, ConfigurationImpact
) on ConfigurationId
| project DeviceName, OSPlatform, ConfigurationId, ConfigurationName, ConfigurationCategory, ConfigurationSubcategory, ConfigurationDescription, RiskDescription, ConfigurationImpact, Tags
----

=== Related topics

* xref:advanced-hunting-overview.adoc[Proactively hunt for threats]
* xref:advanced-hunting-query-language.adoc[Learn the query language]
* xref:advanced-hunting-shared-queries.adoc[Use shared queries]
* xref:advanced-hunting-query-emails-devices.adoc[Hunt across devices, emails, apps, and identities]
* xref:advanced-hunting-schema-tables.adoc[Understand the schema]
* xref:advanced-hunting-best-practices.adoc[Apply query best practices]
* link:/windows/security/threat-protection/microsoft-defender-atp/next-gen-threat-and-vuln-mgt[Overview of Microsoft Defender Vulnerability Management]
